src/test/elements/paypalv2/assets/sales.json

{
  "intent": "sale",
  "note_to_payer": "tani123",
  "payer": {
    "payment_method": "paypal"
  },
  "redirect_urls": {
    "cancel_url": "http://www.hawaii.com",
    "return_url": "http://www.amazon.com"
  },
  "transactions": [{
    "amount": {
      "currency": "USD",
      "details": {
        "handling_fee": "1.00",
        "insurance": "0.01",
        "shipping": "0.03",
        "shipping_discount": "-1.00",
        "subtotal": "30.00",
        "tax": "0.07"
      },
      "total": "30.11"
    },
    "custom": "EBAY_EMS_90048630024435",
    "description": "This is the payment transaction description.",
    "item_list": {
      "items": [{
          "currency": "USD",
          "description": "Brown color hat",
          "name": "hat",
          "price": "3",
          "quantity": "5",
          "sku": "1",
          "tax": "0.01"
        },
        {
          "currency": "USD",
          "description": "Black color hand bag",
          "name": "handbag",
          "price": "15",
          "quantity": "1",
          "sku": "product34",
          "tax": "0.02"
        }
      ],
      "shipping_address": {
        "city": "SAn Jose",
        "country_code": "US",
        "line1": "4thFloor",
        "line2": "unit#34",
        "phone": "011862212345678",
        "postal_code": "95131",
        "recipient_name": "Hello World",
        "state": "CA"
      }
    },
    "payee": {
      "email": "paypal-facilitator@cloud-elements.com"
    },
    "payment_options": {
      "allowed_payment_method": "INSTANT_FUNDING_SOURCE"
    },
    "soft_descriptor": "ECHI5786786"
  }]
}